package 猿辅导面试整理;

/**
 *
 */
public class Main1 {
    /**
     * 1. 二叉搜索树 转双向链表：
     *
     * 2. 二叉搜索树给定节点的下一个节点
     *
     * 相同的思路，中序遍历，
     * 定义全局的parent点；
     */

    /**
     * 1. LeetCode求两个链表只和，从头到尾相加即可
     *     记录一个more表示进位
     * 2. 给定一个数n，输出1-n的字典排序数组，如n=160，输出[1,10,100,101,....,109,11,110,....,160]
     *    字典序:
     */

    /**
     * 同样给了一个整型数组 [100,2,1,4,3,3,101,200] 从这个数组找到连续元素的长度，比如1,2,3,4 最长输出4。
     *
     * 给一个整形数组，要求分为两部分，第一个部分的元素的最大值比第二部分的最小元素要小，
     * 要求左边部分的范围近可能的短,输入第一个部门的长度，
     * 比如[1,1,1,0,6,7,12]长度输出4，这个想了一下没有思路，面试官降低难度给了下面一个题目
     */

    /**
     * 1.树：输出根节点到叶子节点路径之和为target的路径列表
     * 2.列表：一些数，任意排列求可形成最小的值
     *
     *
     */

    /**
     * 给你一个二叉树，从上往下看，然后左往右顺序输出你能看到节点（算法题见18楼，二叉树不是固定的）
     */



}
