package A4MergeIntervals;

/**
 * Author:yaozhiyuan0117@163.com
 * Time:2020/4/24 0:09
 * Describe:
 * version:1.0
 */
public class A0 {
    /**
     *区间合并模式是一个用来处理有区间重叠的很高效的技术。
     * 在设计到区间的很多问题中，通常咱们需要要么判断是否有重叠，要么合并区间，
     * 如果他们重叠的话。这个模式是这么起作用的：给两个区间，一个是a，另外一个是b。
     * 别小看就两个区间，他们之间的关系能跑出来6种情况。详细的就看图啦。
     * a在b的前边且不重叠， a在b的前边重叠，a包含b； 还有反过来三种；
     *
     * 理解和识别这六种情况，灰常重要。因为这能帮你解决一大堆问题。
     * 这些问题从插入区间到优化区间合并都有。
     *
     * 什么时候使用？
     * 当你需要产生一堆相互之间没有交集的区间的时候
     * 当你听到重叠区间的时候
     */
}
