package zhaohang;


/**
 * 按照卡中心校园招聘的要求，HR小招和小商需要从三个科室中（分别为A、B、C）抽派面试官去往不同城市。
 * 两名HR按照以下规定轮流从任一科室选择面试官：每次至少选择一位，至多选择该科室剩余面试官数。最先选不到面试官的HR需要自己出差。
 * 假设HR小招和小商都不想出差且每次选择都采取最优策略，如果是小招先选，写一个函数来判断她是否需要出差。如果不需要出差，请给出第一步的最优策略。
 *
 * 输入为三个正整数，分别代表三个科室的面试官人数，用英文逗号分隔
 *
 * 若小招需要出差，则输出：1；
 * 若小招不需要出差，则输出：第一步选择的科室名称和选择人数，用英文逗号分隔
 *
 * 2,0,4
 * C,2
 *
 */

public class Main4 {
    public static void main(String[] args) {

    }

    // n人数 m个玩偶 k位置
    public static int num(int n, int m, int k){
        // 4 10 2  。。。。 1 1 1 1

        return 1;
    }
}
